{
  "label_sidebar_create_model": "Create a model",
  "label_sidebar_profiling": "Profiling",
  "label_sidebar_models": "Models",
  "label_sidebar_upload": "Upload",
  "label_sidebar_datasetViewer": "Dataset Viewer",
  "label_sidebar_datasets": "Datasets",
  "label_sidebar_logout": "Logout",
  "label_sidebar_manageTeam": "Manage Team",
  "label_sidebar_teamInformation": "Team Information",
  "label_sidebar_addUser": "Add User",
  "label_sidebar_calendar": "Calendar",
  "label_sidebar_faqPage": "FAQ Page",
  "label_profiling_selectDataset": "Select a dataset",
  "label_profiling_startProfiling": "Start Profiling",
  "label_profiling_loadingData": "Loading Data",
  "label_profiling_dataPreprocessing": "Data Preprocessing : Drop unwanted features",
  "label_profiling_dataPreprocessing_bold": "Data preprocessing",
  "label_profiling_dataPreprocessing_desc": " is the process of transforming raw data into an understandable format. It also makes the datasets more complete and efficient to perform data analysis.",
  "label_profiling_dataPreprocessing_desc_2": "Before going into more technical matters we deal with the two ID columns as the model we will use could get confused by them, since it is unrealistic to think that the failure of a machine depends on its identifier. However, while UDI results in being a copy of the dataframe index, the column Product ID is made up of an initial letter followed by five numbers; there is a small chance that an hidden pattern lies behind this structure. However, the initial letter corresponds to the machine Type and the number sequences define three intervals based on the same feature; this allows to confirm that the Product ID column does not actually carry any more information than the feature Type and it is legit to drop it. The following histogram shows the number sequences:",
  "label_profiling_eda": "EDA(Exploratory Data Analysis)",
  "label_profiling_eda_desc": "is an approach to perform initial investigations on data to discover patterns, spot anomalies, test hypothesis and check assumptions with the help of statistics and graphical representations.",
  "label_profiling_eda_desc_2": "just check the descriptions for the numeric features. None missing and on apparent outliers",
  "label_profiling_eda_desc_3": "Taking a look at 'Failure Type' variable",
  "label_profiling_eda_desc_4": "We can see that the dataset is highly unbalanced. Let's further check that with the 'target' variable:",
  "label_profiling_targetAnomalies": "Target anomalies",
  "label_profiling_dataVisualisation": "Data Visualisation",
  "label_profiling_dataVisualisation_desc": "The following pie chart shows the percentages of machines by Type:",
  "label_profiling_dataVisualisation_desc2": "Percentage of failure",
  "label_profiling_dataVisualisation_desc3": "Percentage of failure wrt product type",
  "label_profiling_dataVisualisation_desc4": "Correlation",
  "label_profiling_dataVisualisation_desc5": "-Torque and rotational speed are highly correlated.",
  "label_profiling_dataVisualisation_desc6": "-Process temperature and air temperature are also highly correlated.",
  "label_profiling_dataVisualisation_desc7": "We immediately see that failures occur for extreme values of some features, i.e., the machinery fails either for the lowest or largest values of torque and rotational speed. This is easily spotted in the graph since the green dots are far apart for those features. So, there is a range for normal conditions in which the machines operate, and above or under this range, they tend to fail.",
  "label_profiling_dataVisualisation_desc8": "violin chart to see how torque and rotational speed behave:",
  "label_profiling_dataVisualisation_desc9": "Correllation Heatmap",
  "label_createModel_autoML_Title": "AutoML: rationalisez votre processus d'apprentissage automatique",
  "label_createModel_autoML_Desc": "Laissez notre système faire le gros du travail à votre place. Nous sélectionnerons automatiquement les meilleurs paramètres et algorithmes, garantissant une précision optimale sans intervention manuelle. Asseyez-vous et détendez-vous pendant que nous gérons pour vous les complexités de la sélection de modèles.",
  "label_createModel_autoML_btn": "Automatic creation",
  "label_createModel_or": "OR",
  "label_createModel_manual_Mode_Title": "Manual Mode: Fine-Tune Your Machine Learning Experience",
  "label_createModel_manual_Mode_Desc": "Take full control of your machine learning journey with manual mode. Here, you have the option to manually select parameters and algorithms based on your preferences and expertise. Whether you're experimenting with different parameters or have specific requirements in mind, manual mode allows you to tailor your models to your precise needs.",
  "label_createModel_manual_Mode_btn": "Manual creation",
  "label_createModel_manual_Mode_score": "Your Model's scores :",
  "label_createModel_manual_Mode_question": "Do you want to save it this model ?",
  "label_createModel_manual_Mode_yes": "Yes",
  "label_createModel_manual_Mode_no": "No",
  "label_createModel_autoML_Name": "Name your model :",
  "label_createModel_autoML_Type": "Type :",
  "label_createModel_autoML_Type_Or": "Binary or Multiclass",
  "label_createModel_autoML_create": "Create",
  "label_empty_fields_error": "All fields must be filled",
  "label_creation_model_wait_text": "The model is being created.",
  "label_creation_model_wait_text2": "This may take some time please be patient",
  "label_creation_model_wait_text3": "Pleaser don't leave this page before it finish",
  "label_creation_model_select_algo": "Select an Algorithm",
  "label_models_title": "Model library",
  "label_models_btn": "Use Model",
  "label_upload_title": "Upload a dataset",
  "label_upload_btn": "Upload",
  "label_datasetViewer_title": "Upload & View Excel Sheets",
  "label_datasetViewer_btn": "UPLOAD",
  "label_datasetList_title": "Datasets available on the application",
  "label_datasetList_name": "Name",
  "label_datasetList_date": "Date",
  "label_btn_delete": "Delete",
  "label_areaTop_createUser": "Create User",
  "label_areaTop_manageTeam": "Manage Team",
  "label_areaTop_teamInformation": "Team Information",
  "label_areaTop_calendar": "Calendar",
  "label_areaTop_faq": "FAQ",
  "label_areaTop_dashboard": "Dashboard",
  "label_areaTop_unknown": "Unknown Page",
  "label_form_name": "Name",
  "label_form_email": "Email",
  "label_form_phone": "Phone Number",
  "label_form_age": "Age",
  "label_form_password": "Password",
  "label_form_city": "City",
  "label_form_role": "Role",
  "label_form_create": "Create New User",
  "label_form_update": "Update User",
  "label_dashboard_status_Running": "Running",
  "label_dashboard_status_Failure": "Failure",
  "label_dashboard_status_Danger": "In Danger",
  "label_faq_title": "What kind of support and training do you provide for users?",
  "label_faq_desc": "We offer comprehensive support and training services to ensure that users can maximize the value of the predictive maintenance software. This includes onboarding sessions, user manuals, video tutorials, and ongoing technical support to address any questions or issues that may arise.",
  "label_faq2_title": "Is the software scalable to accommodate growing maintenance needs?",
  "label_faq2_desc": "Yes, our predictive maintenance software is highly scalable and can adapt to the evolving needs of your organization. Whether you have a small fleet of equipment or a large industrial operation, the software can scale to handle increasing volumes of data and support additional users and assets.",
  "label_faq3_title": "How does the software prioritize maintenance tasks?",
  "label_faq3_desc": "The software prioritizes maintenance tasks based on the criticality of equipment, the severity of potential failures, and other factors such as operational constraints and resource availability. By employing advanced algorithms, it helps maintenance teams focus their efforts on tasks that have the greatest impact on equipment reliability and operational efficiency.",
  "label_faq4_title": "How accurate are the predictions made by the software?",
  "label_faq4_desc": "The accuracy of predictions depends on several factors, including the quality and quantity of data available, the algorithms used, and the maintenance team's expertise. Generally, predictive maintenance software can achieve high accuracy rates, especially when trained on comprehensive data sets and tuned for specific equipment types.",
  "label_faq5_title": "How does predictive maintenance differ from other maintenance strategies?",
  "label_faq5_desc": "Unlike reactive maintenance, which involves responding to equipment failures as they occur, and preventive maintenance, which relies on scheduled maintenance tasks, predictive maintenance anticipates failures based on real-time data analysis. It allows maintenance teams to intervene before breakdowns happen, optimizing equipment performance and extending asset lifespan.",
  "label_login_title": "Welcome !",
  "label_login_title2": "Please enter your contact details",
  "label_login_email": "Email",
  "label_login_password": "Password",
  "label_login_connect": "Conncet",
  "label_login_error": "Please enter the Email or Password",
  "label_login_error2": "the Email or Password is wrong",
  "label_upload_error": "File uploaded failed",
  "label_upload_success": "File uploaded successfully"
}
