{
  "label_sidebar_create_model": "Créer un modèle",
  "label_sidebar_profiling": "Profilage",
  "label_sidebar_models": "Modèles",
  "label_sidebar_upload": "Télécharger",
  "label_sidebar_datasetViewer": "Datasets reader",
  "label_sidebar_datasets": "Datasets",
  "label_sidebar_logout": "Déconnexion",
  "label_sidebar_manageTeam": "Gérer l'équipe",
  "label_sidebar_teamInformation": "Informations sur l'équipe",
  "label_sidebar_addUser": "Ajouter un utilisateur",
  "label_sidebar_calendar": "Calendrier",
  "label_sidebar_faqPage": "Page FAQ",
  "label_profiling_selectDataset": "Sélectionner un jeu de données",
  "label_profiling_startProfiling": "Démarrer le profilage",
  "label_profiling_loadingData": "Chargement des données",
  "label_profiling_dataPreprocessing": "Prétraitement des données : Supprimer les fonctionnalités non désirées",
  "label_profiling_dataPreprocessing_bold": "Prétraitement des données",
  "label_profiling_dataPreprocessing_desc": "est le processus de transformation des données brutes en un format compréhensible. Cela rend également les ensembles de données plus complets et plus efficaces pour effectuer l'analyse des données.",
  "label_profiling_dataPreprocessing_desc_2": "Avant d'aborder des questions plus techniques, nous traitons les deux colonnes ID car le modèle que nous utiliserons pourrait être confondu par elles, car il est irréaliste de penser que la défaillance d'une machine dépend de son identifiant. Cependant, alors que UDI est une copie de l'index du dataframe, la colonne ID produit est composée d'une lettre initiale suivie de cinq chiffres ; il y a une petite chance qu'un motif caché se trouve derrière cette structure. Cependant, la lettre initiale correspond au type de machine et les séquences de nombres définissent trois intervalles basés sur la même fonctionnalité ; cela permet de confirmer que la colonne ID produit ne contient pas réellement plus d'informations que la fonctionnalité Type et il est légitime de la supprimer. L'histogramme suivant montre les séquences de nombres :",
  "label_profiling_eda": "Analyse exploratoire des données (EDA)",
  "label_profiling_eda_desc": "est une approche permettant d'effectuer des investigations initiales sur les données pour découvrir des modèles, repérer des anomalies, tester des hypothèses et vérifier des hypothèses à l'aide de statistiques et de représentations graphiques.",
  "label_profiling_eda_desc_2": "vérifiez simplement les descriptions des fonctionnalités numériques. Aucun manquant et pas d'anomalies apparentes",
  "label_profiling_eda_desc_3": "Jeter un œil à la variable 'Type de défaillance'",
  "label_profiling_eda_desc_4": "Nous pouvons voir que l'ensemble de données est très déséquilibré. Vérifions cela plus en détail avec la variable 'cible' :",
  "label_profiling_targetAnomalies": "Anomalies de la cible",
  "label_profiling_dataVisualisation": "Visualisation des données",
  "label_profiling_dataVisualisation_desc": "Le diagramme circulaire suivant montre les pourcentages de machines par type :",
  "label_profiling_dataVisualisation_desc2": "Pourcentage de défaillance",
  "label_profiling_dataVisualisation_desc3": "Pourcentage de défaillance par rapport au type de produit",
  "label_profiling_dataVisualisation_desc4": "Corrélation",
  "label_profiling_dataVisualisation_desc5": "-Le couple couple et vitesse de rotation est fortement corrélé.",
  "label_profiling_dataVisualisation_desc6": "-La température du processus et la température de l'air sont également fortement corrélées.",
  "label_profiling_dataVisualisation_desc7": "Nous constatons immédiatement que les défaillances se produisent pour des valeurs extrêmes de certaines fonctionnalités, c'est-à-dire que les machines échouent soit pour les valeurs les plus basses, soit pour les plus élevées du couple et de la vitesse de rotation. Cela est facilement repérable dans le graphique car les points verts sont très éloignés pour ces fonctionnalités. Ainsi, il existe une plage de conditions normales dans laquelle les machines fonctionnent, et au-dessus ou en dessous de cette plage, elles ont tendance à échouer.",
  "label_profiling_dataVisualisation_desc8": "Diagramme en violon pour voir comment le couple et la vitesse de rotation se comportent :",
  "label_profiling_dataVisualisation_desc9": "Carte thermique de corrélation",
  "label_createModel_autoML_Title": "AutoML : rationalisez votre processus d'apprentissage automatique",
  "label_createModel_autoML_Desc": "Laissez notre système faire le gros du travail à votre place. Nous sélectionnerons automatiquement les meilleurs paramètres et algorithmes, garantissant une précision optimale sans intervention manuelle. Asseyez-vous et détendez-vous pendant que nous gérons pour vous les complexités de la sélection de modèles.",
  "label_createModel_autoML_btn": "Création automatique",
  "label_createModel_or": "OU",
  "label_createModel_manual_Mode_Title": "Mode manuel : Affinez votre expérience d'apprentissage automatique",
  "label_createModel_manual_Mode_Desc": "Prenez le contrôle total de votre parcours d'apprentissage automatique avec le mode manuel. Ici, vous avez la possibilité de sélectionner manuellement les paramètres et les algorithmes en fonction de vos préférences et de votre expertise. Que vous expérimentiez différents paramètres ou que vous ayez des exigences spécifiques en tête, le mode manuel vous permet d'adapter vos modèles à vos besoins précis.",
  "label_createModel_manual_Mode_btn": "Création manuelle",
  "label_createModel_manual_Mode_score": "Les scores de votre modèle :",
  "label_createModel_manual_Mode_question": "Voulez-vous enregistrer ce modèle ?",
  "label_createModel_manual_Mode_yes": "Oui",
  "label_createModel_manual_Mode_no": "Non",
  "label_createModel_autoML_Name": "Nommez votre modèle :",
  "label_createModel_autoML_Type": "Type :",
  "label_createModel_autoML_Type_Or": "Binaire ou Multiclasse",
  "label_createModel_autoML_create": "Créer",
  "label_empty_fields_error": "Tous les champs doivent être remplis",
  "label_creation_model_wait_text": "Le modèle est en cours de création.",
  "label_creation_model_wait_text2": "Cela peut prendre un certain temps, veuillez patienter",
  "label_creation_model_wait_text3": "S'il vous plaît ne quittez pas cette page avant qu'elle ne se termine",
  "label_creation_model_select_algo": "Sélectionner un algorithme",
  "label_models_title": "Bibliothèque de modèles",
  "label_models_btn": "Utiliser le modèle",
  "label_upload_title": "Télécharger un jeu de données",
  "label_upload_btn": "Télécharger",
  "label_datasetViewer_title": "Télécharger et visualiser des feuilles Excel",
  "label_datasetViewer_btn": "TÉLÉCHARGER",
  "label_datasetList_title": "Datasets disponibles sur l'application",
  "label_datasetList_name": "Nom",
  "label_datasetList_date": "Date",
  "label_btn_delete": "Supprimer",
  "label_areaTop_createUser": "Créer un utilisateur",
  "label_areaTop_manageTeam": "Gérer l'équipe",
  "label_areaTop_teamInformation": "Informations sur l'équipe",
  "label_areaTop_calendar": "Calendrier",
  "label_areaTop_faq": "FAQ",
  "label_areaTop_dashboard": "Tableau de bord",
  "label_areaTop_unknown": "Page inconnue",
  "label_form_name": "Nom",
  "label_form_email": "Email",
  "label_form_phone": "Numéro de téléphone",
  "label_form_age": "Âge",
  "label_form_password": "Mot de passe",
  "label_form_city": "Ville",
  "label_form_role": "Rôle",
  "label_form_create": "Créer un nouvel utilisateur",
  "label_form_update": "Mettre à jour l'utilisateur",
  "label_dashboard_status_Running": "En cours",
  "label_dashboard_status_Failure": "Échec",
  "label_dashboard_status_Danger": "En danger",
  "label_faq_title": "Quel type de support et de formation fournissez-vous aux utilisateurs ?",
  "label_faq_desc": "Nous offrons des services de support et de formation complets pour garantir que les utilisateurs puissent maximiser la valeur du logiciel de maintenance prédictive. Cela comprend des sessions de formation, des manuels d'utilisation, des tutoriels vidéo et un support technique continu pour répondre à toutes les questions ou problèmes qui pourraient survenir.",
  "label_faq2_title": "Le logiciel est-il évolutif pour répondre aux besoins croissants de maintenance ?",
  "label_faq2_desc": "Oui, notre logiciel de maintenance prédictive est hautement évolutif et peut s'adapter aux besoins évolutifs de votre organisation. Que vous disposiez d'une petite flotte d'équipements ou d'une grande opération industrielle, le logiciel peut s'adapter pour gérer des volumes croissants de données et prendre en charge des utilisateurs et des actifs supplémentaires.",
  "label_faq3_title": "Comment le logiciel priorise-t-il les tâches de maintenance ?",
  "label_faq3_desc": "Le logiciel priorise les tâches de maintenance en fonction de la criticité de l'équipement, de la gravité des pannes potentielles et d'autres facteurs tels que les contraintes opérationnelles et la disponibilité des ressources. En utilisant des algorithmes avancés, il aide les équipes de maintenance à concentrer leurs efforts sur les tâches ayant le plus grand impact sur la fiabilité de l'équipement et l'efficacité opérationnelle.",
  "label_faq4_title": "Quelle est la précision des prédictions faites par le logiciel ?",
  "label_faq4_desc": "La précision des prédictions dépend de plusieurs facteurs, notamment la qualité et la quantité de données disponibles, les algorithmes utilisés et l'expertise de l'équipe de maintenance. En général, le logiciel de maintenance prédictive peut atteindre des taux de précision élevés, surtout lorsqu'il est entraîné sur des ensembles de données complets et ajusté pour des types d'équipements spécifiques.",
  "label_faq5_title": "En quoi la maintenance prédictive diffère-t-elle des autres stratégies de maintenance ?",
  "label_faq5_desc": "Contrairement à la maintenance réactive, qui consiste à répondre aux pannes d'équipement au fur et à mesure qu'elles se produisent, et à la maintenance préventive, qui repose sur des tâches de maintenance planifiées, la maintenance prédictive anticipe les pannes sur la base de l'analyse en temps réel des données. Elle permet aux équipes de maintenance d'intervenir avant que les pannes ne se produisent, optimisant ainsi les performances de l'équipement et prolongeant sa durée de vie.",
  "label_login_title": "Bienvenue !",
  "label_login_title2": "Veuillez saisir vos coordonnées",
  "label_login_email": "Email",
  "label_login_password": "Mot de passe",
  "label_login_connect": "Connexion",
  "label_login_error": "Veuillez saisir l'email ou le mot de passe",
  "label_login_error2": "l'email ou le mot de passe est incorrect",
  "label_upload_error": "Échec du téléchargement du fichier",
  "label_upload_success": "Fichier téléchargé avec succès"
}
